gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/pmic/pca9422/fsl_pca9422.h
/*
 * Copyright 2023-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_PCA9422_H_
#define FSL_PCA9422_H_

/*******************************************************************************
 * Includes
 ******************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "fsl_common.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief PCA9422 Default I2C address. */
#define PCA9422_DEFAULT_I2C_ADDR (0x61U)

/*! @brief Define the Register Memory Map of PCA9422. */
#define PCA9422_DEV_INFO      (0x00U)
#define PCA9422_TOP_INT       (0x01U)
#define PCA9422_SUB_INT0      (0x02U)
#define PCA9422_SUB_INT0_MASK (0x03U)
#define PCA9422_SUB_INT1      (0x04U)
#define PCA9422_SUB_INT1_MASK (0x05U)
#define PCA9422_SUB_INT2      (0x06U)
#define PCA9422_SUB_INT2_MASK (0x07U)
#define PCA9422_TOP_STAT      (0x08U)

#define PCA9422_TOP_CNTL0 (0x09U)
#define PCA9422_TOP_CNTL1 (0x0AU)
#define PCA9422_TOP_CNTL2 (0x0BU)
#define PCA9422_TOP_CNTL3 (0x0CU)
#define PCA9422_TOP_CNTL4 (0x0DU)

#define PCA9422_INT1        (0x0EU)
#define PCA9422_INT1_MASK   (0x0FU)
#define PCA9422_INT1_STATUS (0x10U)

#define PCA9422_PWR_STATE    (0x11U)
#define PCA9422_RESET_CTRL   (0x12U)
#define PCA9422_SW_RST       (0x13U)
#define PCA9422_PWR_SEQ_CTRL (0x14U)
#define PCA9422_SYS_CFG1     (0x15U)
#define PCA9422_SYS_CFG2     (0x16U)

#define PCA9422_REG_STATUS         (0x17U)
#define PCA9422_BUCK123_DVS_CFG1   (0x18U)
#define PCA9422_BUCK123_DVS_CFG2   (0x19U)
#define PCA9422_BUCK1CTRL          (0x1AU)
#define PCA9422_BUCK1OUT_DVS0      (0x1BU)
#define PCA9422_BUCK1OUT_DVS1      (0x1CU)
#define PCA9422_BUCK1OUT_DVS2      (0x1DU)
#define PCA9422_BUCK1OUT_DVS3      (0x1EU)
#define PCA9422_BUCK1OUT_DVS4      (0x1FU)
#define PCA9422_BUCK1OUT_DVS5      (0x20U)
#define PCA9422_BUCK1OUT_DVS6      (0x21U)
#define PCA9422_BUCK1OUT_DVS7      (0x22U)
#define PCA9422_BUCK1OUT_STBY      (0x23U)
#define PCA9422_BUCK1OUT_MAX_LIMIT (0x24U)
#define PCA9422_BUCK1OUT_SLEEP     (0x25U)

#define PCA9422_BUCK2CTRL          (0x26U)
#define PCA9422_BUCK2OUT_DVS0      (0x27U)
#define PCA9422_BUCK2OUT_DVS1      (0x28U)
#define PCA9422_BUCK2OUT_DVS2      (0x29U)
#define PCA9422_BUCK2OUT_DVS3      (0x2AU)
#define PCA9422_BUCK2OUT_DVS4      (0x2BU)
#define PCA9422_BUCK2OUT_DVS5      (0x2CU)
#define PCA9422_BUCK2OUT_DVS6      (0x2DU)
#define PCA9422_BUCK2OUT_DVS7      (0x2EU)
#define PCA9422_BUCK2OUT_STBY      (0x2FU)
#define PCA9422_BUCK2OUT_MAX_LIMIT (0x30U)
#define PCA9422_BUCK2OUT_SLEEP     (0x31U)

#define PCA9422_BUCK3CTRL          (0x32U)
#define PCA9422_BUCK3OUT_DVS0      (0x33U)
#define PCA9422_BUCK3OUT_DVS1      (0x34U)
#define PCA9422_BUCK3OUT_DVS2      (0x35U)
#define PCA9422_BUCK3OUT_DVS3      (0x36U)
#define PCA9422_BUCK3OUT_DVS4      (0x37U)
#define PCA9422_BUCK3OUT_DVS5      (0x38U)
#define PCA9422_BUCK3OUT_DVS6      (0x39U)
#define PCA9422_BUCK3OUT_DVS7      (0x3AU)
#define PCA9422_BUCK3OUT_STBY      (0x3BU)
#define PCA9422_BUCK3OUT_MAX_LIMIT (0x3CU)
#define PCA9422_BUCK3OUT_SLEEP     (0x3DU)
#define PCA9422_LPM_FPWM           (0x3EU)

#define PCA9422_LDO2_CFG      (0x3FU)
#define PCA9422_LDO2_OUT      (0x40U)
#define PCA9422_LDO2_OUT_STBY (0x41U)
#define PCA9422_LDO3_CFG      (0x42U)
#define PCA9422_LDO3_OUT      (0x43U)
#define PCA9422_LDO3_OUT_STBY (0x44U)
#define PCA9422_LDO23_CFG     (0x45U)
#define PCA9422_LDO4_CFG      (0x46U)
#define PCA9422_LDO4_OUT      (0x47U)
#define PCA9422_LDO4_OUT_STBY (0x48U)
#define PCA9422_LDO1_CFG1     (0x49U)
#define PCA9422_LDO1_CFG2     (0x4AU)

#define PCA9422_LDO2_OUT_SLEEP (0x4BU)
#define PCA9422_LDO3_OUT_SLEEP (0x4CU)
#define PCA9422_LDO4_OUT_SLEEP (0x4DU)

#define PCA9422_SW4_BB_CFG1       (0x4EU)
#define PCA9422_SW4_BB_CFG2       (0x4FU)
#define PCA9422_SW4_BB_CFG3       (0x50U)
#define PCA9422_SW4_BB_CFG4       (0x51U)
#define PCA9422_SW4_BB_MAX_LIMIT  (0x52U)
#define PCA9422_SW4_BB_MIN_LIMIT  (0x53U)
#define PCA9422_SW4_BB_VOUT_SLEEP (0x54U)

#define PCA9422_LED_CFG1    (0x55U)
#define PCA9422_LED_CFG2    (0x56U)
#define PCA9422_GPIO_STATUS (0x57U)
#define PCA9422_GPIO_CFG    (0x58U)

#define PCA9422_REGULATOR_EN (0x59U)
#define PCA9422_WAKEUP_SEQ1  (0x5AU)
#define PCA9422_WAKEUP_SEQ2  (0x5BU)

#define PCA9422_INT_DEVICE_0       (0x5C)
#define PCA9422_INT_DEVICE_1       (0x5D)
#define PCA9422_INT_CHARGER_0      (0x5E)
#define PCA9422_INT_CHARGER_1      (0x5F)
#define PCA9422_INT_CHARGER_2      (0x60)
#define PCA9422_INT_CHARGER_3      (0x61)
#define PCA9422_INT_DEVICE_0_MASK  (0x62)
#define PCA9422_INT_DEVICE_1_MASK  (0x63)
#define PCA9422_INT_CHARGER_0_MASK (0x64)
#define PCA9422_INT_CHARGER_1_MASK (0x65)
#define PCA9422_INT_CHARGER_2_MASK (0x66)
#define PCA9422_INT_CHARGER_3_MASK (0x67)
#define PCA9422_DEVICE_0_STS       (0x68)
#define PCA9422_DEVICE_1_STS       (0x69)
#define PCA9422_CHARGER_0_STS      (0x6A)
#define PCA9422_CHARGER_1_STS      (0x6B)
#define PCA9422_CHARGER_2_STS      (0x6C)
#define PCA9422_CHARGER_3_STS      (0x6D)

#define PCA9422_CHGIN_CNTL_0 (0x6E)
#define PCA9422_CHGIN_CNTL_1 (0x6F)
#define PCA9422_CHGIN_CNTL_2 (0x70)
#define PCA9422_CHGIN_CNTL_3 (0x71)

#define PCA9422_CHG_CNTL0  (0x72U)
#define PCA9422_CHG_CNTL1  (0x73U)
#define PCA9422_CHG_CNTL2  (0x74U)
#define PCA9422_CHG_CNTL3  (0x75U)
#define PCA9422_CHG_CNTL4  (0x76U)
#define PCA9422_CHG_CNTL5  (0x77U)
#define PCA9422_CHG_CNTL6  (0x78U)
#define PCA9422_CHG_CNTL7  (0x79U)
#define PCA9422_CHG_CNTL8  (0x7AU)
#define PCA9422_CHG_CNTL9  (0x7BU)
#define PCA9422_CHG_CNTL10 (0x7CU)

#define PCA9422_REG_LOCK (0x80U)

/*! @brief Define the Register Mask - device information */
#define PCA9422_DEV_ID  (0xF8U)
#define PCA9422_DEV_REV (0x07U)

/*! @brief Define the Register Masks - Top-level System Control Register. */
#define PCA9422_TOP_INT_SYS   (0x10U)
#define PCA9422_TOP_INT_CHG   (0x08U)
#define PCA9422_TOP_INT_SW_BB (0x04U)
#define PCA9422_TOP_INT_SW    (0x02U)
#define PCA9422_TOP_INT_LDO   (0x01U)

#define PCA9422_SUB_INT0_ON_SHORT_PUSH    (0x80U)
#define PCA9422_SUB_INT0_THERMAL_WARNING  (0x40U)
#define PCA9422_SUB_INT0_THSD             (0x20U)
#define PCA9422_SUB_INT0_THSD_EXIT        (0x10U)
#define PCA9422_SUB_INT0_VSYS_MIN_WARNING (0x08U)
#define PCA9422_SUB_INT0_WD_TIMER         (0x04U)
#define PCA9422_SUB_INT0_VSYS_OVP         (0x02U)
#define PCA9422_SUB_INT0_VSYS_OVP_EXT     (0x01U)
#define PCA9422_SUB_INT0_ALL              (0xFFU)

#define PCA9422_SUB_INT1_MODE_CMPL    (0x02U)
#define PCA9422_SUB_INT1_ON_LONG_PUSH (0x01U)
#define PCA9422_SUB_INT1_ALL          (0x03U)

