gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/pmic/pca9422/fsl_pca9422.h
#define PCA9422_PWR_SEQ_CTRL_PSQ_TON_STEP  (0x0CU)
#define PCA9422_PWR_SEQ_CTRL_PSQ_TOFF_STEP (0x03U)

#define PCA9422_SYS_CFG1_STANDBY_CTRL (0x40U)
#define PCA9422_SYS_CFG1_STANDBY_CFG  (0x20U)
#define PCA9422_SYS_CFG1_DVS_CTRL2_EN (0x04U)
#define PCA9422_SYS_CFG1_TFLT_SD_WAIT (0x02U)
#define PCA9422_SYS_CFG1_THERM_SD_DIS (0x01U)

#define PCA9422_SYS_CFG2_PWR_SAVE        (0x30U)
#define PCA9422_SYS_CFG2_GPIO_PULLUP_CFG (0x08U)
#define PCA9422_SYS_CFG2_POK_PU          (0x04U)
#define PCA9422_SYS_CFG2_VSYS_UVLO_SEL   (0x03U)

#define PCA9422_REG_STATUS_VOUTSW1_OK  (0x80U)
#define PCA9422_REG_STATUS_VOUTSW2_OK  (0x40U)
#define PCA9422_REG_STATUS_VOUTSW3_OK  (0x20U)
#define PCA9422_REG_STATUS_VOUTSW4_OK  (0x10U)
#define PCA9422_REG_STATUS_VOUTLDO1_OK (0x08U)
#define PCA9422_REG_STATUS_VOUTLDO2_OK (0x04U)
#define PCA9422_REG_STATUS_VOUTLDO3_OK (0x02U)
#define PCA9422_REG_STATUS_VOUTLDO4_OK (0x01U)

/* BUCK */
#define PCA9422_BUCK123_DVS_CFG1_B1_DVS_UP  (0x80U)
#define PCA9422_BUCK123_DVS_CFG1_B1_DVS_DN  (0x40U)
#define PCA9422_BUCK123_DVS_CFG1_B2_DVS_UP  (0x20U)
#define PCA9422_BUCK123_DVS_CFG1_B2_DVS_DN  (0x10U)
#define PCA9422_BUCK123_DVS_CFG1_MODE_PULSE (0x08U)
#define PCA9422_BUCK123_DVS_CFG1_SMART_MODE (0x04U)
#define PCA9422_BUCK123_DVS_CFG1_BUCK_SEL   (0x03U)

#define PCA9422_BUCK123_DVS_CFG2_B1_DVS_CTRL (0xC0U)
#define PCA9422_BUCK123_DVS_CFG2_B2_DVS_CTRL (0x30U)
#define PCA9422_BUCK123_DVS_CFG2_B3_DVS_CTRL (0x0CU)
#define PCA9422_BUCK123_DVS_CFG2_B3_DVS_UP   (0x02U)
#define PCA9422_BUCK123_DVS_CFG2_B3_DVS_DN   (0x01U)

#define PCA9422_BUCKXCTRL_BX_RAMP   (0xC0U)
#define PCA9422_BUCKXCTRL_BX_LPMODE (0x30U)
#define PCA9422_BUCKXCTRL_BX_AD     (0x08U)
#define PCA9422_BUCKXCTRL_BX_FPWM   (0x04U)
#define PCA9422_BUCKXCTRL_BX_ENMODE (0x03U)

#define PCA9422_BUCKXOUT_DVS0_BX_DVS0           (0xFFU)
#define PCA9422_BUCKXOUT_DVS1_BX_DVS1           (0xFFU)
#define PCA9422_BUCKXOUT_DVS2_BX_DVS2           (0xFFU)
#define PCA9422_BUCKXOUT_DVS3_BX_DVS3           (0xFFU)
#define PCA9422_BUCKXOUT_DVS4_BX_DVS4           (0xFFU)
#define PCA9422_BUCKXOUT_DVS5_BX_DVS5           (0xFFU)
#define PCA9422_BUCKXOUT_DVS6_BX_DVS6           (0xFFU)
#define PCA9422_BUCKXOUT_DVS7_BX_DVS7           (0xFFU)
#define PCA9422_BUCKXOUT_STDBY_BX_STDBY         (0xFFU)
#define PCA9422_BUCKXOUT_MAX_LIMIT_BX_MAX_LIMIT (0xFFU)
#define PCA9422_BUCKXOUT_SLEEP_BX_SLEEP         (0xFFU)

#define PCA9422_LPM_FPWM_B3_LPM_FPWM_EN (0x04U)
#define PCA9422_LPM_FPWM_B2_LPM_FPWM_EN (0x02U)
#define PCA9422_LPM_FPWM_B1_LPM_FPWM_EN (0x01U)

/* LDO2 */
#define PCA9422_LDO2_CFG_L2_CSEL   (0xC0U)
#define PCA9422_LDO2_CFG_L2_LLSEL  (0x30U)
#define PCA9422_LDO2_CFG_L2_LPMODE (0x0CU)
#define PCA9422_LDO2_CFG_L2_ENMODE (0x03U)

#define PCA9422_LDO2_OUT_L2_AD        (0x80U)
#define PCA9422_LDO2_OUT_L2_INL2_MDET (0x40U)
#define PCA9422_LDO2_OUT_L2_OUT       (0x3FU)

#define PCA9422_LDO2_OUT_STBY_L2_OUT_STBY (0x3FU)

/* LDO3 */
#define PCA9422_LDO3_CFG_L3_CSEL   (0xC0U)
#define PCA9422_LDO3_CFG_L3_LLSEL  (0x30U)
#define PCA9422_LDO3_CFG_L3_LPMODE (0x0CU)
#define PCA9422_LDO3_CFG_L3_ENMODE (0x03U)

#define PCA9422_LDO3_OUT_L3_AD        (0x80U)
#define PCA9422_LDO3_OUT_L3_INL3_MDET (0x40U)
#define PCA9422_LDO3_OUT_L3_OUT       (0x3FU)

#define PCA9422_LDO3_OUT_STBY_L3_OUT_STBY (0x3FU)

#define PCA9422_LDO23_CFG_LDO3_MODE    (0x80U)
#define PCA9422_LDO23_CFG_LDO2_MODE    (0x40U)
#define PCA9422_LDO23_CFG_L2_INL2_VSEL (0x20U)
#define PCA9422_LDO23_CFG_L3_INL3_VSEL (0x10U)

/* LDO4 */
#define PCA9422_LDO4_CFG_L4_AD     (0x10U)
#define PCA9422_LDO4_CFG_L4_ENMODE (0x03U)
#define PCA9422_LDO4_OUT_L4_OUT    (0x7FU)

#define PCA9422_LDO4_OUT_STBY_L4_OUT_STBY (0x7FU)

/* LDO1 */
#define PCA9422_LDO1_CFG1_L1_AD  (0x80U)
#define PCA9422_LDO1_CFG1_L1_OUT (0x7FU)

#define PCA9422_LDO1_CFG2_L1_ENMODE (0x01U)

#define PCA9422_LDO2_OUT_SLEEP_L2_OUT_SLEEP (0x3FU)
#define PCA9422_LDO3_OUT_SLEEP_L3_OUT_SLEEP (0x3FU)
#define PCA9422_LDO4_OUT_SLEEP_L4_OUT_SLEEP (0x7FU)

/* SW4 BB */
#define PCA9422_SW4_BB_CFG1_BB_FPWM          (0x08U)
#define PCA9422_SW4_BB_CFG1_BB_FAULT_OC_CTRL (0x04U)
#define PCA9422_SW4_BB_CFG1_BB_SOFT_STDN     (0x02U)
#define PCA9422_SW4_BB_CFG1_BB_DIS           (0x01U)

#define PCA9422_SW4_BB_CFG2_BB_ENABLE  (0x40U)
#define PCA9422_SW4_BB_CFG2_BB_MODESEL (0x30U)
#define PCA9422_SW4_BB_CFG2_BB_ENMODE  (0x0CU)
#define PCA9422_SW4_BB_CFG2_BB_LPMODE  (0x03U)

#define PCA9422_SW4_BB_CFG3_BB_VOUT             (0xFFU)
#define PCA9422_SW4_BB_CFG4_BB_VOUT_STBY        (0xFFU)
#define PCA9422_SW4_BB_MAX_LIMIT_BB_MAX_LIMIT   (0xFFU)
#define PCA9422_SW4_BB_MIM_LIMIT_BB_MIM_LIMIT   (0xFFU)
#define PCA9422_SW4_BB_VOUT_SLEEP_BB_VOUT_SLEEP (0xFFU)

/* LED */
#define PCA9422_LED_CFG1_LED_EN   (0x80U)
#define PCA9422_LED_CFG1_LED_RAMP (0x40U)
#define PCA9422_LED_CFG1_LED_PWM  (0x3FU)

#define PCA9422_LED_CFG2_LEDOVRD     (0x20U)
#define PCA9422_LED_CFG2_LED_CFG     (0x10U)
#define PCA9422_LED_CFG2_LED_CURRENT (0x0CU)
#define PCA9422_LED_CFG2_LED_FREQ    (0x03U)

/* GPIO */
#define PCA9422_GPIO_STATUS_GPIO_STATUS (0x01U)

#define PCA9422_GPIO_CFG_GPIO_OUT      (0x80U)
#define PCA9422_GPIO_CFG_GPIO_R_CFG2   (0x40U)
#define PCA9422_GPIO_CFG_GPIO_R_CFG1   (0x20U)
#define PCA9422_GPIO_CFG_GPIO_OUT_CFG  (0x10U)
#define PCA9422_GPIO_CFG_GPIO_GPIO_CFG (0x0FU)

/* Regulator EN */
#define PCA9422_REGULATOR_EN_B1_ENABLE (0x20U)
#define PCA9422_REGULATOR_EN_B2_ENABLE (0x10U)
#define PCA9422_REGULATOR_EN_B3_ENABLE (0x08U)
#define PCA9422_REGULATOR_EN_L2_ENABLE (0x04U)
#define PCA9422_REGULATOR_EN_L3_ENABLE (0x02U)
#define PCA9422_REGULATOR_EN_L4_ENABLE (0x01U)

#define PCA9422_WAKEUP_SEQ1_BB_WAKEUP_GR (0xC0U)
#define PCA9422_WAKEUP_SEQ1_B3_WAKEUP_GR (0x30U)
#define PCA9422_WAKEUP_SEQ1_B2_WAKEUP_GR (0x0CU)
#define PCA9422_WAKEUP_SEQ1_B1_WAKEUP_GR (0x03U)

#define PCA9422_WAKEUP_SEQ2_WAKEUP_SEQ_CFG (0xC0U)
#define PCA9422_WAKEUP_SEQ2_L4_WAKEUP_GR   (0x30U)
#define PCA9422_WAKEUP_SEQ2_L3_WAKEUP_GR   (0x0CU)
#define PCA9422_WAKEUP_SEQ2_L2_WAKEUP_GR   (0x03U)

#define PCA94R22_REG_LOCK_UNLOCK_KEY (0xFFU)

/*! @brief PCA9422 Device information */
/*! @brief PCA9422 Device revision */
typedef enum _pca9422_dev_rev
{
    kPCA9422_DevRevA0 = 0x00U, /* Device revision A0 */
    kPCA9422_DevRevB0 = 0x01U, /* Device revision B0 */
} pca9422_dev_rev_t;

/*! @brief PCA9422 Top level function definition. */
/*! @brief PCA9422 Watchdog timer setting definition. */
typedef enum _pca9422_wd_timer
{
    kPCA9422_WdTimerDisabled = 0x00U, /* Watch dog timer disabled. */
    kPCA9422_WdTimer16s      = 0x40U, /* Watch dog timer timeout value is 16 sec. */
    kPCA9422_WdTimer32s      = 0x80U, /* Watch dog timer timeout value is 32 sec. */
    kPCA9422_WdTimer64s      = 0xC0U, /* Watch dog timer timeout value is 64 sec. */
} pca9422_wd_timer_t;

/*! @brief PCA9422 Battery Charger definition. */
/*! @brief PCA9422 AICL threshold on CHGIN definition. */
typedef enum _pca9422_aicl_v
{
    kPCA9422_AICLV4p5V = 0x00U, /* AICL Threshould on VIN is 4.5V */
    kPCA9422_AICLV4p6V = 0x02U, /* AICL Threshould on VIN is 4.6V */
    kPCA9422_AICLV4p7V = 0x04U, /* AICL Threshould on VIN is 4.7V */
    kPCA9422_AICLV4p8V = 0x06U, /* AICL Threshould on VIN is 4.8V */
} pca9422_aicl_v_t;

/*! @brief PCA9422 Input Current Limit on CHGIN definition. */
typedef enum _pca9422_chgin_ilim
{
    kPCA9422_ChgInIlim_45mA   = 0x00U,
    kPCA9422_ChgInIlim_70mA   = 0x01U,
    kPCA9422_ChgInIlim_95mA   = 0x02U,
    kPCA9422_ChgInIlim_120mA  = 0x03U,
    kPCA9422_ChgInIlim_145mA  = 0x04U,
    kPCA9422_ChgInIlim_170mA  = 0x05U,
    kPCA9422_ChgInIlim_195mA  = 0x06U,
    kPCA9422_ChgInIlim_220mA  = 0x07U,
    kPCA9422_ChgInIlim_245mA  = 0x08U,
    kPCA9422_ChgInIlim_270mA  = 0x09U,
    kPCA9422_ChgInIlim_295mA  = 0x0AU,
    kPCA9422_ChgInIlim_320mA  = 0x0BU,
    kPCA9422_ChgInIlim_345mA  = 0x0CU,
    kPCA9422_ChgInIlim_370mA  = 0x0DU,
    kPCA9422_ChgInIlim_395mA  = 0x0EU,
    kPCA9422_ChgInIlim_420mA  = 0x0FU,
    kPCA9422_ChgInIlim_445mA  = 0x10U,
    kPCA9422_ChgInIlim_470mA  = 0x11U,
    kPCA9422_ChgInIlim_495mA  = 0x12U,
    kPCA9422_ChgInIlim_520mA  = 0x13U,
    kPCA9422_ChgInIlim_545mA  = 0x14U,
    kPCA9422_ChgInIlim_570mA  = 0x15U,
    kPCA9422_ChgInIlim_595mA  = 0x16U,
    kPCA9422_ChgInIlim_620mA  = 0x17U,
    kPCA9422_ChgInIlim_645mA  = 0x18U,
    kPCA9422_ChgInIlim_670mA  = 0x19U,
    kPCA9422_ChgInIlim_695mA  = 0x1AU,
    kPCA9422_ChgInIlim_795mA  = 0x1BU,
    kPCA9422_ChgInIlim_895mA  = 0x1CU,
    kPCA9422_ChgInIlim_995mA  = 0x1DU,
    kPCA9422_ChgInIlim_1095mA = 0x1EU,
    kPCA9422_ChgInIlim_1195mA = 0x1FU,
} pca9422_chgin_ilim_t;

/*! @brief PCA9422 VSYS Regulation voltage definition. */
#define PCA9422_VSYS_REG_MIN      (4425U)
#define PCA9422_VSYS_REG_MAX      (4800U)
#define PCA9422_VSYS_REG_STEP     (25U)
#define PCA9422_VSYS_REG(_volt)   (_volt - PCA9422_VSYS_REG_MIN) / PCA9422_VSYS_REG_STEP
#define PCA9422_VBAT_CLAMP_OFFSET (200U)

/*! @brief PCA9422 Unlock or lock all Charger Control register definition. */
#define PCA9422_CHARGER_LOCK_UNLOCK (0x30U)
#define PCA9422_CHARGER_LOCK_LOCK   (0x00U)

