gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA922 V_WARM_50C threshold definition. */
typedef enum _pca9422_v_warm_50c
{
    kPCA9422_Vwarm50C40p75percent = 0x00U, /* Vwarm threshold is 40.75% of VTHREM_BIAS. */
    kPCA9422_Vwarm50C36p53percent = 0x04U, /* Vwarm threshold is 36.53% of VTHREM_BIAS. */
    kPCA9422_Vwarm50C32p63percent = 0x08U, /* Vwarm threshold is 32.63% of VTHREM_BIAS. */
    kPCA9422_Vwarm50C29p07percent = 0x0CU, /* Vwarm threshold is 29.07% of VTHREM_BIAS. */
} pca9422_v_warm_50c_t;

/*! @brief PCA922 V_WARM_45C threshold definition. */
typedef enum _pca9422_v_warm_45c
{
    kPCA9422_Vwarm45C40p75percent = 0x00U, /* Vwarm threshold is 40.75% of VTHREM_BIAS. */
    kPCA9422_Vwarm45C36p53percent = 0x10U, /* Vwarm threshold is 36.53% of VTHREM_BIAS. */
    kPCA9422_Vwarm45C32p63percent = 0x20U, /* Vwarm threshold is 32.63% of VTHREM_BIAS. */
    kPCA9422_Vwarm45C29p07percent = 0x30U, /* Vwarm threshold is 29.07% of VTHREM_BIAS. */
} pca9422_v_warm_45c_t;

/*! @brief PCA9422 Precharge Current definition. */
typedef enum _pca9422_prechg_i
{
    kPCA9422_PrechgI10percent = 0x00U, /* Precharge current is 10% of Fast charge current. */
    kPCA9422_PrechgI20percent = 0x02U, /* Precharge current is 20% of Fast charge current. */
} pca9422_prechg_i_t;

/*! @brief PCA9422 current step on battery charge current definition. */
typedef enum _pca9422_chg_i_step
{
    kPCA9422_ChgIStep2p5mA = 0x00U, /* Battery charge current step is 2.5mA. */
    kPCA9422_ChgIStep5p0mA = 0x01U, /* Battery charge current step is 5.0mA. */
} pca9422_chg_i_step_t;

/*! @brief PCA9422 fast charge current default value definition. */
#define PCA9422_I_FAST_CHG_DFT (0x27U)

/*! @brief PCA9422 VBAT floating voltage definition. */
#define PCA9422_VBAT_REG_MIN    (3600U)
#define PCA9422_VBAT_REG_MAX    (4600U)
#define PCA9422_VBAT_REG_STEP   (10U)
#define PCA9422_VBAT_REG(_volt) (_volt - PCA9422_VBAT_REG_MIN) / PCA9422_VBAT_REG_STEP

/*! @brief PCA9422 fast charge current default value definition. */
#define PCA9422_I_FAST_CHG_DFT (0x27U) /* 100mA */

/*! @brief PCA9422 Recharge threshold definition. */
typedef enum _pca9422_recharge_th
{
    kPCA9422_RechargeTh100mV = 0x00U, /* Recharge threshold based on VBAT <= VBAT_REG - 100mV */
    kPCA9422_RechargeTh150mV = 0x10U, /* Recharge threshold based on VBAT <= VBAT_REG - 150mV */
    kPCA9422_RechargeTh200mV = 0x20U, /* Recharge threshold based on VBAT <= VBAT_REG - 200mV */
} pca9422_recharge_th_t;

/*! @brief PCA9422 Top-off current definition. */
typedef enum _pca9422_topoff_i
{
    kPCA9422_TopoffI2p5percent  = 0x00U, /* Topoff current is 2.5% of Fast charge current. */
    kPCA9422_TopoffI5p0percent  = 0x04U, /* Topoff current is 5.0% of Fast charge current. */
    kPCA9422_TopoffI7p5percent  = 0x08U, /* Topoff current is 7.5% of Fast charge current. */
    kPCA9422_TopoffI10p0percent = 0x0CU, /* Topoff current is 10.0% of Fast charge current. */
} pca9422_topoff_i_t;

/*! @brief PCA9422 Precharge timer definition. */
typedef enum _pca9422_precharge_timer
{
    kPCA9422_PrechgTimerDisable = 0x00U, /* Precharge timer is disabled. */
    kPCA9422_PrechgTimer15min   = 0x01U, /* Precharge timer set 15min. */
    kPCA9422_PrechgTimer30min   = 0x02U, /* Precharge timer set 30min. */
    kPCA9422_PrechgTimer60min   = 0x03U, /* Precharge timer set 60min. */
} pca9422_precharge_timer_t;

/*! @brief PCA9422 charger control 5 register default value definition. */
#define PCA9422_CHARGER_CNTL_5_DFT (0x01U)

/*! @brief PCA9422 V_HOT_60C threshold definition. */
typedef enum _pca9422_v_hot_60c
{
    kPCA9422_Vhot60C32p63percent = 0x00U, /* Vhot threshold is 32.63% of VTHREM_BIAS. */
    kPCA9422_Vhot60C29p07percent = 0x40U, /* Vhot threshold is 29.07% of VTHREM_BIAS. */
    kPCA9422_Vhot60C25p84percent = 0x80U, /* Vhot threshold is 25.84% of VTHREM_BIAS. */
    kPCA9422_Vhot60C22p94percent = 0xC0U, /* Vhot threshold is 22.94% of VTHREM_BIAS. */
} pca9422_v_hot_60c_t;

/*! @brief PCA9422 V_COOL_10C threshold definition. */
typedef enum _pca9422_v_cool_10c
{
    kPCA9422_Vcool10C74p18percent = 0x00U, /* Vcool threshold is 74.18% of VTHREM_BIAS. */
    kPCA9422_Vcool10C69p62percent = 0x04U, /* Vcool threshold is 69.62% of VTHREM_BIAS. */
    kPCA9422_Vcool10C64p82percent = 0x08U, /* Vcool threshold is 64.82% of VTHREM_BIAS. */
    kPCA9422_Vcool10C59p87percent = 0x0CU, /* Vcool threshold is 59.87% of VTHREM_BIAS. */
} pca9422_v_cool_10c_t;

/*! @brief PCA9422 V_COLD_0C threshold definition. */
typedef enum _pca9422_v_cold_0c
{
    kPCA9422_Vcold0C82p26percent = 0x00U, /* Vcold threshold is 82.26% of VTHREM_BIAS. */
    kPCA9422_Vcold0C78p42percent = 0x01U, /* Vcold threshold is 78.42% of VTHREM_BIAS. */
    kPCA9422_Vcold0C74p18percent = 0x02U, /* Vcold threshold is 74.18% of VTHREM_BIAS. */
    kPCA9422_Vcold0C69p62percent = 0x03U, /* Vcold threshold is 69.62% of VTHREM_BIAS. */
} pca9422_v_cold_0c_t;

/*! @brief PCA9422 Fast charge timer definition. */
typedef enum _pca9422_fast_chg_timer
{
    kPCA9422_FastchgTimerDisable = 0x00U, /* Fast charge timer is disabled */
    kPCA9422_FastchgTimer3h      = 0x40U, /* Fast charge timer set 3 hours */
    kPCA9422_FastchgTimer5h      = 0x80U, /* Fast charge timer set 5 hours */
    kPCA9422_FastchgTimer7h      = 0xC0U, /* Fast charge timer set 7 hours */
} pca9422_fast_chg_timer_t;

/*! @brief PCA9422 New charge current at COOL(10C) condition definition. */
typedef enum _pca9422_new_i_vbat_10c
{
    kPCA9422_NewIVbat10C_StayIFastchg = 0x00U,       /* Stays a current IFAST_CHG */
    kPCA9422_NewIVbat10C_0p75percentIFastchg =
        0x04U,                                       /* Set [2.5mA or 5.0mA + 0.75 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat10C_0p5percentIFastchg = 0x08U, /* Set [2.5mA or 5.0mA + 0.50 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat10C_0p25percentIFastchg =
        0x0CU,                                       /* Set [2.5mA or 5.0mA + 0.25 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
} pca9422_new_i_vbat_10c_t;

/*! @brief PCA9422 New charge current at WARM Plus(50C) condition definition. */
typedef enum _pca9422_new_i_vbat_50c
{
    kPCA9422_NewIVbat50C_StayIFastchg = 0x00U,       /* Stays a current IFAST_CHG */
    kPCA9422_NewIVbat50C_0p75percentIFastchg =
        0x10U,                                       /* Set [2.5mA or 5.0mA + 0.75 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat50C_0p5percentIFastchg = 0x20U, /* Set [2.5mA or 5.0mA + 0.50 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat50C_0p25percentIFastchg =
        0x30U,                                       /* Set [2.5mA or 5.0mA + 0.25 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
} pca9422_new_i_vbat_50c_t;

/*! @brief PCA9422 New charge current at WARM(45C) condition definition. */
typedef enum _pca9422_new_i_vbat_45c
{
    kPCA9422_NewIVbat45C_StayIFastchg = 0x00U,       /* Stays a current IFAST_CHG */
    kPCA9422_NewIVbat45C_0p75percentIFastchg =
        0x04U,                                       /* Set [2.5mA or 5.0mA + 0.75 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat45C_0p5percentIFastchg = 0x08U, /* Set [2.5mA or 5.0mA + 0.50 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
    kPCA9422_NewIVbat45C_0p25percentIFastchg =
        0x0CU,                                       /* Set [2.5mA or 5.0mA + 0.25 *I_FAST_CHG[6:0] x 2.5mA or 5.0mA] */
} pca9422_new_i_vbat_45c_t;

