gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA9422 New VBAT_REG at WARM condition, WARM_45C or WARM_50C, definition. */
typedef enum _pca9422_new_vbat_45c
{
    kPCA9422_NewVbat45C_StayVbatReg       = 0x00U, /* Stays a current VVBAT_REG */
    kPCA9422_NewVbat45C_VbatRegMinus100mV = 0x01U, /* Set a new value with (VVBAT_REG – 100mV) */
    kPCA9422_NewVbat45C_VbatRegMinus150mV = 0x02U, /* Set a new value with (VVBAT_REG – 150mV) */
    kPCA9422_NewVbat45C_VbatRegMinus200mV = 0x03U, /* Set a new value with (VVBAT_REG – 200mV) */
} pca9422_new_vbat_45c_t;

/*! @brief PCA9422 New VBAT_REG at WARM condition, WARM_45C or WARM_50C, definition. */
typedef enum _pca9422_new_vbat_50c
{
    kPCA9422_NewVbat50C_StayVbatReg       = 0x00U, /* Stays a current VVBAT_REG */
    kPCA9422_NewVbat50C_VbatRegMinus100mV = 0x40U, /* Set a new value with (VVBAT_REG – 100mV) */
    kPCA9422_NewVbat50C_VbatRegMinus150mV = 0x80U, /* Set a new value with (VVBAT_REG – 150mV) */
    kPCA9422_NewVbat50C_VbatRegMinus200mV = 0xC0U, /* Set a new value with (VVBAT_REG – 200mV) */
} pca9422_new_vbat_50c_t;

/*! @brief PCA9422 thermal regulation threshold definition. */
typedef enum _pca9422_thermal_reg
{
    kPCA9422_ThermalRegulationDisable = 0x00U, /* Thermal regulation threshold is disabled */
    kPCA9422_ThermalRegulation60C     = 0x08U, /* Thermal regulation threshuold is 60C */
    kPCA9422_ThermalRegulation70C     = 0x10U, /* Thermal regulation threshuold is 70C */
    kPCA9422_ThermalRegulation80C     = 0x18U, /* Thermal regulation threshuold is 80C */
    kPCA9422_ThermalRegulation90C     = 0x20U, /* Thermal regulation threshuold is 90C */
    kPCA9422_ThermalRegulation100C    = 0x28U, /* Thermal regulation threshuold is 100C */
} pca9422_thermal_regulation_t;

/*! @brief PCA9422 Top-off timer definition. */
typedef enum _pca9422_top_off_timer
{
    kPCA9422_TopoffTimerDisable = 0x00U,
    kPCA9422_TopoffTimer5min    = 0x01U,
    kPCA9422_TopoffTimer10min   = 0x02U,
    kPCA9422_TopoffTimer15min   = 0x03U,
    kPCA9422_TopoffTimer20min   = 0x04U,
    kPCA9422_TopoffTimer25min   = 0x05U,
    kPCA9422_TopoffTimer30min   = 0x06U,
    kPCA9422_TopoffTimer35min   = 0x07U,
} pca9422_top_off_timer_t;

/*! @brief PCA9422 AMUX wait time definition. */
typedef enum _pca9422_amux_auto_off_wait
{
    kPCA9422_AMUXAutoOffWait_256us   = 0x00U,
    kPCA9422_AMUXAutoOffWait_1088us  = 0x40U,
    kPCA9422_AMUXAutoOffWait_8192us  = 0x80U,
    kPCA9422_AMUXAutoOffWait_32768us = 0xC0U,
} pca9422_amux_auto_off_wait_t;

/*! @brief PCA9422 AMUX mode definition. */
typedef enum _pca9422_amux_mode
{
    kPCA9422_AMUXModeManual      = 0x00U,
    kPCA9422_AMUXModeAutoOneshot = 0x20U,
} pca9422_amux_mode_t;

/*! @brief PCA9422 AMUX VBAT/VSYS channel scale factor definition. */
typedef enum _pca9422_amux_vbat_vsys_gain
{
    kPCA9422_AMUXVbatVsysGain_1dvd3 = 0x00U, /* 1/3 */
    kPCA9422_AMUXVbatVsysGain_1dvd4 = 0x10U, /* 1/4 */
} pca9422_amux_vbat_vsys_gain_t;

/*! @brief PCA9422 AMUX THERM and THERM_BIAS channel scale factor definition. */
typedef enum _pca9422_amux_therm_gain
{
    kPCA9422_AMUXThermGain_1       = 0x00U, /* 1 */
    kPCA9422_AMUXThermGain_1dvd1p5 = 0x08U, /* 1/1.5 */
} pca9422_amux_therm_gain_t;

/* @brief PCA9422 AMUX channel definition. */
typedef enum _pca9422_amux_channel
{
    kPCA9422_AMUXChannel_Off       = 0x00U,
    kPCA9422_AMUXChannel_Vbat      = 0x01U,
    kPCA9422_AMUXChannel_Therm     = 0x02U,
    kPCA9422_AMUXChannel_ThermBias = 0x03U,
    kPCA9422_AMUXChannel_Vsys      = 0x04U,
    kPCA9422_AMUXChannel_Vin       = 0x05U,
    kPCA9422_AMUXChannel_Max       = 0x06U,
} pca9422_amux_channel_t;

/* @brief PCA9422 AMUX configuration structure definition */
typedef struct _pca9422_amux_config
{
    /* AMUX wait time to be automatically disabled in automatic one-shot mode. */
    uint8_t waitTime;
    /* AMUX mode */
    uint8_t amuxMode;
    /* VBAT/VSYS channel scale factor */
    uint8_t vbatGain;
    /* THERM and THERM_BIAS channels scale factor */
    uint8_t thermGain;
    /* AMUX channel */
    uint8_t amuxChannel;
} pca9422_amux_config_t;

/*! @brief PCA9422 Regulator */
/*! @brief PCA9422 Regulator Status definition. */
typedef enum _pca9422_reg_status
{
    kPCA9422_RegStatusVoutSw1OK  = 0x80U, /* SW1 VOUT Power good status */
    kPCA9422_RegStatusVoutSw2OK  = 0x40U, /* SW2 VOUT Power good status */
    kPCA9422_RegStatusVoutSw3OK  = 0x20U, /* SW3 VOUT Power good status */
    kPCA9422_RegStatusVoutSw4OK  = 0x10U, /* SW4 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo1OK = 0x08U, /* LDO1 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo2OK = 0x04U, /* LDO2 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo3OK = 0x02U, /* LDO3 VOUT Power good status */
    kPCA9422_RegStatusVoutLdo4OK = 0x01U, /* LDO4 VOUT Power good status */
} pca9422_reg_status_t;

/*! @brief PCA9422 Power mode definition. */
typedef enum _pca9422_power_mode
{
    kPCA9422_ActiveModeDVS0 = 0x00U, /* Active mode - DVS0 */
    kPCA9422_ActiveModeDVS1 = 0x01U, /* Active mode - DVS1 */
    kPCA9422_ActiveModeDVS2 = 0x02U, /* Active mode - DVS2 */
    kPCA9422_ActiveModeDVS3 = 0x03U, /* Active mode - DVS3 */
    kPCA9422_ActiveModeDVS4 = 0x04U, /* Active mode - DVS4 */
    kPCA9422_ActiveModeDVS5 = 0x05U, /* Active mode - DVS5 */
    kPCA9422_ActiveModeDVS6 = 0x06U, /* Active mode - DVS6 */
    kPCA9422_ActiveModeDVS7 = 0x07U, /* Active mode - DVS7 */
    kPCA9422_StandbyMode    = 0x08U, /* STANDBY mode */
    kPCA9422_NoneMode       = 0x09U, /* None mode */
    kPCA9422_DPStandbyMode  = 0x0AU, /* DPSTANDBY mode */
    kPCA9422_SleepMode      = 0x0BU, /* SLEEP mode */
    kPCA9422_PowerModeMax   = 0x0CU, /* Max Power mode */
} pca9422_power_mode_t;

/*! @brief PCA9422 Standby control definition */
typedef enum _pca9422_standby_ctrl
{
    kPCA9422_StandbyCtrlPins                = 0x00U,
    kPCA9422_StandbyCtrlStandbyConfigandPin = 0x40U,
} pca9422_standby_ctrl_t;

/*! @brief PCA9422 Standby configuration definition */
typedef enum _pca9422_standby_cfg
{
    kPCA9422_StandbyCfgStandby   = 0x00U,
    kPCA9422_StandbyCfgDPStandby = 0x20U,
} pca9422_standby_cfg_t;

/*! @brief PCA9422 DVS_CTRL2 pin enable definition */
typedef enum _pca9422_dvs_ctrl2_en
{
    kPCA9422_DVSCtrl2PinIgnore     = 0x00U,
    kPCA9422_DVSCtrl2PinUseDVSCtrl = 0x04U,
} pca9422_dvs_ctrl2_en_t;

/*! @brief PCA9422 Power Save mode definition */
typedef enum _pca9422_power_save_mode
{
    kPCA9422_PowerSaveUseLowIq         = 0x00U,
    kPCA9422_PowerSaveStandbyDPStandby = 0x10U,
    kPCA9422_PowerSaveDPStandby        = 0x20U,
    kPCA9422_PowerSaveNormal           = 0x30U,
} pca9422_power_save_mode_t;

/*! @brief PCA9422 GPIO pull-up configuration definition */
typedef enum _pca9422_gpio_pullup_cfg
{
    kPCA9422_GPIOPullupVsys = 0x00U,
    kPCA9422_GPIOPullupLDO1 = 0x08U,
} pca9422_gpio_pullup_cfg_t;

