gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA9422 VSYS UVLO threshold definition */
typedef enum _pca9422_vsys_uvlo_sel
{
    kPCA9422_VsysUVLOSel2p6V = 0x00U,
    kPCA9422_VsysUVLOSel2p7V = 0x01U,
    kPCA9422_VsysUVLOSel2p8V = 0x02U,
} pca9422_vsys_uvlo_sel_t;

/*! @brief PCA9422 DVS smart mode configuration definition */
typedef enum _pca9422_smart_mode
{
    kPCA9422_SmartModeDisabled = 0x00U,
    kPCA9422_SmartModeEnabled  = 0x04U,
} pca9422_smart_mode_t;

/*! @brief PCA9422 Run state definition. */
typedef enum _pca9422_run_state
{
    kPCA9422_RunStateActiveMode    = 0x00U,
    kPCA9422_RunStateSleepMode     = 0x01U,
    kPCA9422_RunStateStandbyMode   = 0x02U,
    kPCA9422_RunStateDPStandbyMode = 0x03U,
} pca9422_run_state_t;

/*! @brief PCA9422 Regulator definition. */
typedef enum _pca9422_regulator
{
    kPCA9422_RegulatorSwitch1 = 0x80U, /* Switch1 regulator. */
    kPCA9422_RegulatorSwitch2 = 0x40U, /* Switch2 regulator. */
    kPCA9422_RegulatorSwitch3 = 0x20U, /* Switch3 regulator. */
    kPCA9422_RegulatorSwitch4 = 0x10U, /* Switch4 regulator. */
    kPCA9422_RegulatorLdo1    = 0x08U, /* LDO1 regulator. */
    kPCA9422_RegulatorLdo2    = 0x04U, /* LDO2 regulator. */
    kPCA9422_RegulatorLdo3    = 0x02U, /* LDO3 regulator. */
    kPCA9422_RegulatorLdo4    = 0x01U, /* LDO4 regulator. */
} pca9422_regulator_t;

/*! @brief PCA9422 Regulator Enable mode definition. */
typedef enum _pca9422_enmode
{
    kPCA9422_EnmodeOnAll                = 0x00U,
    kPCA9422_EnmodeOnActiveSleepStandby = 0x01U,
    kPCA9422_EnmodeOnActiveSleep        = 0x02U,
    kPCA9422_EnmodeOnActive             = 0x03U,
} pca9422_enmode_t;

/*! @brief PCA9422 Buck DVS control definition. */
enum _pca9422_bx_dvs_ctrl
{
    kPCA9422_DVS0thrI2CInActiveAndSleep = 0x00U, /* BUCKxOUT_DVS0 Reg through I2C in both ACTIVE and SLEEP modes */
    kPCA9422_DVS0thrI2CInAcitveAndBxOUTSLEEPInSleep =
        0x01U, /* BUCKxOUT_DVS0 Reg through I2C in ACTIVE mode, and BUCKxOUT_SLEEP when in SLEEP mode */
    kPCA9422_PinInActiveAndBxOUTSLEEPInSleep =
        0x02U, /* DVS_CTRL[2:0] pins in ACTIVE mode and BUCKxOUT_SLEEP when in SLEEP mode */
    kPCA9422_DVS0thrI2CInAcitveAndPinInSleep =
        0x03U, /* BUCKxOUT_DVS0 Reg through I2C in ACTIVE mode, and DVS_CTRL[2:0] pins when in SLEEP mode */
};

/*! @brief PCA9422 Buck DVS Ramp definition. */
typedef enum _pca9422_bx_ramp
{
    kPCA9422_BxRamp_25mVp1us = 0x00U,
    kPCA9422_BxRamp_25mVp2us = 0x40U,
    kPCA9422_BxRamp_25mVp4us = 0x80U,
    kPCA9422_BxRamp_25mVp8us = 0xC0U,
} pca9422_bx_ramp_t;

/*! @brief PCA9422 Buck power mode definition. */
typedef enum _pca9422_bx_lpmode
{
    kPCA9422_BxLPmodeNormal             = 0x00U, /* Normal mode */
    kPCA9422_BxLPmodeAtStandbyDPStandby = 0x10U, /* Low power mode at STANDBY mode and DPSTANDBY mode */
    kPCA9422_BxLPmodeAtDPStandby        = 0x20U, /* Low power mode at DPSTANDBY mode */
    kPCA9422_BxLPmodeForcedLPM          = 0x30U, /* Forced low power mode */
} pca9422_bx_lpmode_t;

/*! @brief PCA9422 Buck Active Discharge definition. */
typedef enum _pca9422_bx_ad
{
    kPCA9422_BxADDisabled = 0x00U,
    kPCA9422_BxADEnabled  = 0x08U,
} pca9422_bx_ad_t;

/*! @brief PCA9422 Buck Forced PWM definition. */
typedef enum _pca9422_bx_fpwm_mode
{
    kPCA9422_BxAutoPFMandPWM = 0x00U,
    kPCA9422_BxForcedPWM     = 0x04U,
} pca9422_bx_fpwm_mode_t;

/*! @brief PCA9422 Buck1 OUT voltage definition. (uV unit) */
#define PCA9422_BUCK1_OUT_MIN        (400000U)  /* 400mV */
#define PCA9422_BUCK1_OUT_STEP       (6250U)    /* 6.25mV */
#define PCA9422_BUCK1_OUT_MAX        (1975000U) /* 1975mV */
#define PCA9422_BUCK1_OUT_VAL(_volt) (_volt - PCA9422_BUCK1_OUT_MIN) / PCA9422_BUCK1_OUT_STEP
#define PCA9422_BUCK1_OUT_VOLT(_val) (_val * PCA9422_BUCK1_OUT_STEP) + PCA9422_BUCK1_OUT_MIN

/*! @brief PCA9422 Buck2 OUT voltage definition. (uV unit) */
#define PCA9422_BUCK2_OUT_MIN        (400000U)  /* 400mV */
#define PCA9422_BUCK2_OUT_STEP       (25000U)   /* 25mV */
#define PCA9422_BUCK2_OUT_MAX        (3400000U) /* 3400mV */
#define PCA9422_BUCK2_OUT_VAL(_volt) (_volt - PCA9422_BUCK2_OUT_MIN) / PCA9422_BUCK2_OUT_STEP
#define PCA9422_BUCK2_OUT_VOLT(_val) (_val * PCA9422_BUCK2_OUT_STEP) + PCA9422_BUCK2_OUT_MIN

/*! @brief PCA9422 Buck3 OUT voltage definition. (uV unit) */
#define PCA9422_BUCK3_OUT_MIN        (400000U)  /* 400mV */
#define PCA9422_BUCK3_OUT_STEP       (6250U)    /* 6.25mV */
#define PCA9422_BUCK3_OUT_MAX        (1975000U) /* 1975mV */
#define PCA9422_BUCK3_OUT_VAL(_volt) (_volt - PCA9422_BUCK3_OUT_MIN) / PCA9422_BUCK3_OUT_STEP
#define PCA9422_BUCK3_OUT_VOLT(_val) (_val * PCA9422_BUCK3_OUT_STEP) + PCA9422_BUCK3_OUT_MIN

/*! @brief PCA9422 LDO2/3 output capacitor selection definition. */
typedef enum _pca9422_ldo23_csel
{
    kPCA9422_LDO23CoutLess5uF       = 0x00U, /* Setting for Cout < 5uF */
    kPCA9422_LDO23CoutHigh5uF       = 0x40U, /* Setting for Cout > 5uF */
    kPCA9422_LDO23AutoCoutDetection = 0x80U, /* Auto Cout detection */
} pca9422_ldo23_csel_t;

/*! @brief PCA9422 LDO2/3 output trace resistance compensation definition. */
typedef enum _pca9422_ldo23_llsel
{
    kPCA9422_LDO23LLSelNoComp = 0x00U, /* No Compensation */
    kPCA9422_LDO23LLSel15mOhm = 0x10U, /* 15mOhm */
    kPCA9422_LDO23LLSel30mOhm = 0x20U, /* 30mOhm */
    kPCA9422_LDO23LLSel45mOhm = 0x30U, /* 45mOhm */
} pca9422_ldo23_llsel_t;

/*! @brief PCA9422 LDO2/3 power mode definition. */
typedef enum _pca9422_ldo23_lpmode
{
    kPCA9422_LDO23LPmodeAtRunState         = 0x00U,
    kPCA9422_LDO23LPmodeAtStandbyDPStandby = 0x04U,
    kPCA9422_LDO23LPmodeAtDPStandby        = 0x08U,
    kPCA9422_LDO23LPmodeNormal             = 0x0CU,
} pca9422_ldo23_lpmode_t;

/*! @brief PCA9422 LDO2/3 Load Switch mode definition. */
enum _pca9422_ldo23_mode
{
    kPCA9422_LDO23LDOMode        = 0x00U,
    kPCA9422_LDO23LoadSwitchMode = 0x01U,
};

/*! @brief PCA9422 LDO1 OUT voltage definition. (uV unit) */
#define PCA9422_LDO1_OUT_MIN        (800000U)  /* 800mV */
#define PCA9422_LDO1_OUT_STEP       (25000U)   /* 25mV */
#define PCA9422_LDO1_OUT_MAX        (3000000U) /* 3000mV */
#define PCA9422_LDO1_OUT_VAL(_volt) (_volt - PCA9422_LDO1_OUT_MIN) / PCA9422_LDO1_OUT_STEP
#define PCA9422_LDO1_OUT_VOLT(_val) (_val * PCA9422_LDO1_OUT_STEP) + PCA9422_LDO1_OUT_MIN

/*! @brief PCA9422 LDO2/3 OUT voltage definition. (uV unit) */
#define PCA9422_LDO23_OUT_MIN        (500000U)  /* 500mV */
#define PCA9422_LDO23_OUT_STEP       (25000U)   /* 25mV */
#define PCA9422_LDO23_OUT_MAX        (1950000U) /* 1950mV */
#define PCA9422_LDO23_OUT_VAL(_volt) (_volt - PCA9422_LDO23_OUT_MIN) / PCA9422_LDO23_OUT_STEP
#define PCA9422_LDO23_OUT_VOLT(_val) (_val * PCA9422_LDO23_OUT_STEP) + PCA9422_LDO23_OUT_MIN

