gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/pmic/pca9422/fsl_pca9422.h
/*! @brief PCA9422 LDO4 OUT voltage definition. (uV unit) */
#define PCA9422_LDO4_OUT_MIN        (800000U)  /* 800mV */
#define PCA9422_LDO4_OUT_STEP       (25000U)   /* 25mV */
#define PCA9422_LDO4_OUT_MAX        (3300000U) /* 3300mV */
#define PCA9422_LDO4_OUT_VAL(_volt) (_volt - PCA9422_LDO4_OUT_MIN) / PCA9422_LDO4_OUT_STEP
#define PCA9422_LDO4_OUT_VOLT(_val) (_val * PCA9422_LDO4_OUT_STEP) + PCA9422_LDO4_OUT_MIN

/*! @brief PCA9422 Buck-Boost FPWM mode definition. */
typedef enum _pca9422_bb_fpwm_mode
{
    kPCA9422_BBAutoPFMandPWM = 0x00U, /* Automatic PFM and PWM mode transition */
    kPCA9422_BBForcedPWM     = 0x08U, /* Forced PWM mode */
} pca9422_bb_fpwm_mode_t;

/*! @brief PCA9422 Buck-Boost overcurrent response definition. */
typedef enum _pca9422_bb_fault_oc_ctrl
{
    kPCA9422_BBNotTurnOff = 0x00U,
    kPCA9422_BBTurnOff    = 0x04U,
} pca9422_bb_fault_oc_ctrl_t;

/*! @brief PCA9422 Buck-Boost active discharge control definition. */
typedef enum _pca9422_bb_soft_stdn
{
    kPCA9422_BBRampDownDisabled = 0x00U, /* Digital ramping down Vout is disabled */
    kPCA9422_BBRampDownEnabled  = 0x02U, /* Digital ramping down Vout is enabled */
} pca9422_bb_soft_stdn_t;

/*! @brief PCA9422 Buck-Boost passive discharge control definition. */
typedef enum _pca9422_bb_dis
{
    kPCA9422_BBPassiveDsgDisabled = 0x00U,
    kPCA9422_BBPassiveDsgEnabled  = 0x01U,
} pca9422_bb_dis_t;

/*! @brief PCA9422 Buck-Boost enable in RUN state definition. */
typedef enum _pca9422_bb_enable_in_run
{
    kPCA9422_BBOffInRunState = 0x00U,
    kPCA9422_BBOnInRunState  = 0x40U,
} pca9422_bb_enable_in_run_t;

/*! @brief PCA9422 Buck-Boost operation mode definition. */
typedef enum _pca9422_bb_mode
{
    kPCA9422_BBOPmodeAuto            = 0x00U, /* Auto */
    kPCA9422_BBOPmodeForcedBoostOnly = 0x10U, /* Forced BOOST only */
    kPCA9422_BBOPmodeForcedBuckOnly  = 0x20U, /* Forced BUCK only */
} pca9422_bb_mode_t;

/*! @brief PCA9422 Buck-Boost Enable mode definition. */
typedef enum _pca9422_bb_enmode
{
    kPCA9422_BBEnmodeOnAll                = 0x00U,
    kPCA9422_BBEnmodeOnActiveSleepStandby = 0x04U,
    kPCA9422_BBEnmodeOnActiveSleep        = 0x08U,
    kPCA9422_BBEnmodeOnActive             = 0x0CU,
} pca9422_bb_enmode_t;

/*! @brief PCA9422 Buck-Boost power mode definition. */
typedef enum _pca9422_bb_lpmode
{
    kPCA9422_BBLPmodeNormal             = 0x00U,
    kPCA9422_BBLPmodeAtStandbyDPStandby = 0x01U,
    kPCA9422_BBLPmodeAtDPStandby        = 0x02U,
    kPCA9422_BBLPmodeForcedLPM          = 0x03U,
} pca9422_bb_lpmode_t;

/*! @brief PCA9422 Regulator power mode definition. */
typedef enum _pca9422_reg_lpmode
{
    kPCA9422_LPmodeNormal             = 0x00U,
    kPCA9422_LPmodeAtStandbyDPStandby = 0x01U,
    kPCA9422_LPpmodeAtDPstandby       = 0x02U,
    kPCA9422_LPmodeForcedLPM          = 0x03U,
} pca9422_reg_lpmode_t;

/*! @brief PCA9422 Buck-Boost OUT voltage definition. (uV unit) */
#define PCA9422_BB_OUT_MIN        (1800000U) /* 1800mV */
#define PCA9422_BB_OUT_STEP       (25000U)   /* 25mV */
#define PCA9422_BB_OUT_MAX        (5000000U) /* 5000mV */
#define PCA9422_BB_OUT_VAL(_volt) (_volt - PCA9422_BB_OUT_MIN) / PCA9422_BB_OUT_STEP
#define PCA9422_BB_OUT_VOLT(_val) (_val * PCA9422_BB_OUT_STEP) + PCA9422_BB_OUT_MIN

/*! @brief PCA9422 Regulator Voltage definition. */
typedef enum _pca9422_vout
{
    kPCA9422_RegVout        = 0x00U,
    kPCA9422_RegSleepVout   = 0x01U,
    kPCA9422_RegStandbyVout = 0x02U,
    kPCA9422_SWMaxVout      = 0x03U,
    kPCA9422_BBMinVout      = 0x04U,
    kPCA9422_SWDVS0Vout     = 0x05U,
    kPCA9422_SWDVS1Vout     = 0x06U,
    kPCA9422_SWDVS2Vout     = 0x07U,
    kPCA9422_SWDVS3Vout     = 0x08U,
    kPCA9422_SWDVS4Vout     = 0x09U,
    kPCA9422_SWDVS5Vout     = 0x0AU,
    kPCA9422_SWDVS6Vout     = 0x0BU,
    kPCA9422_SWDVS7Vout     = 0x0CU,
} pca9422_vout_t;

/*! @brief PCA9422 LED enable definition. */
typedef enum _pca9422_led_en
{
    kPCA9422_LedEnDisable = 0x00U,
    kPCA9422_LedEnEnable  = 0x80U,
} pca9422_led_en_t;

/*! @brief PCA9422 LED control definition. */
typedef enum _pca9422_led_ovrd
{
    kPCA9422_LedControlByStateMachine = 0x00U,
    kPCA9422_LedControlBySoftware     = 0x20U,
} pca9422_led_ovrd_t;

/*! @brief PCA9422 Output voltage configuration lock definition. */
typedef enum _pca9422_reg_lock
{
    kPCA9422_RegLockUnlockKey = 0x5CU,
    kPCA9422_RegLockLockKey   = 0x00U,
} pca9422_reg_lock_t;

/*! @brief PCA9422 Mode Configuration definition. */
typedef struct _pca9422_modecfg
{
    uint32_t sw1OutVolt;  /* uV */
    uint32_t sw2OutVolt;  /* uV */
    uint32_t sw3OutVolt;  /* uV */
    uint32_t sw4OutVolt;  /* uV */
    uint32_t ldo1OutVolt; /* uV */
    uint32_t ldo2OutVolt; /* uV */
    uint32_t ldo3OutVolt; /* uV */
    uint32_t ldo4OutVolt; /* uV */
} pca9422_modecfg_t;

/*! @brief PCA9422 Enmode Configuration definition */
typedef struct _pca9422_enmodecfg
{
    pca9422_enmode_t sw1OutEnMode;
    pca9422_enmode_t sw2OutEnMode;
    pca9422_enmode_t sw3OutEnMode;
    pca9422_enmode_t sw4OutEnMode;
    pca9422_enmode_t ldo1OutEnMode;
    pca9422_enmode_t ldo2OutEnMode;
    pca9422_enmode_t ldo3OutEnMode;
    pca9422_enmode_t ldo4OutEnMode;
} pca9422_enmodecfg_t;

/*! @brief PCA9422 Enable configuration definition */
typedef struct _pca9422_enablecfg
{
    bool enableSw1Out;
    bool enableSw2Out;
    bool enableSw3Out;
    bool enableSw4Out;
    bool enableLdo1Out;
    bool enableLdo2Out;
    bool enableLdo3Out;
    bool enableLdo4Out;
} pca9422_enablecfg_t;

/*! @brief PCA9422 Regulator Enable in RUN state definition */
typedef struct _pca9422_regultoren
{
    bool sw1Enable;
    bool sw2Enable;
    bool sw3Enable;
    bool sw4Enable;
    bool ldo1Enable;
    bool ldo2Enable;
    bool ldo3Enable;
    bool ldo4Enable;
} pca9422_regulatoren_t;

/*! @brief PCA9422 Handle definition. */
typedef struct _pca9422_handle
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* The I2C Slave Address Read From OTP. */
    uint8_t slaveAddress;
} pca9422_handle_t;

/*! @brief PCA9422 Configuration Structure definition. */
/*! @brief PCA9422 Charger Configuration Structure definition. */
typedef struct _pca9422_charger_config
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* Charge current */
    /* Precharge current */
    pca9422_prechg_i_t prechgI;
    /* Charging current step */
    pca9422_chg_i_step_t chgIStep;
    /* Top-off current */
    pca9422_topoff_i_t topoffI;
    /* Fast Charge current */
    uint16_t fastI;
    /* Charging voltage */
    /* VBAT float voltage */
    uint16_t vbatReg;
    /* Recharge threshold */
    pca9422_recharge_th_t rechgVolt;
    /* Charging timer */
    /* Precharge timer - refer _pca9422_precharge_timer */
    pca9422_precharge_timer_t prechgTime;
    /* Fast charge timer - refer _pca9422_fast_chg_timer  */
    pca9422_fast_chg_timer_t fastchgTime;
    /* Top-off timer */
    pca9422_top_off_timer_t topoffTime;
    /* JEITA parameters */
    /* Warm voltage threshold - 45C, refer _pca9422_v_warm */
    pca9422_v_warm_45c_t warmVolt;
    /* Warm plus voltage threshold - 50C, refer _pca9422_v_warm */
    pca9422_v_warm_50c_t warmPlusVolt;
    /* Hot voltage threshold - 60C */
    pca9422_v_hot_60c_t hotVolt;
    /* Cool voltage threshold - 10C */
    pca9422_v_cool_10c_t coolVolt;
    /* Cold voltage threshold - 0C */
    pca9422_v_cold_0c_t coldVolt;
    /* New regulation voltage - Warm(45C) */
    pca9422_new_vbat_45c_t warmVbatReg;
    /* New regulation voltage - Warm plus(50C) */
    pca9422_new_vbat_50c_t warmPlusVbatReg;
    /* New Fast charge current - Cold(10C) */
    pca9422_new_i_vbat_10c_t coldIVbat;
    /* New Fast charge current - Warm(45C) */
    pca9422_new_i_vbat_45c_t warmIVbat;
    /* New Fast charge current - Warm plus(50C) */
    pca9422_new_i_vbat_50c_t warmPlusIVbat;
    /* AICL threshold */
    pca9422_aicl_v_t aiclV;
    /* Input current limit */
    pca9422_chgin_ilim_t icl;
    /* VSYS regulation voltage */
    uint16_t vsysReg;
    /* AMUX wait time */
    pca9422_amux_auto_off_wait_t amuxWaitTime;
    /* AMUX mode */
    pca9422_amux_mode_t amuxMode;
    /* VBAT/VSYS channel scale factor */
    pca9422_amux_vbat_vsys_gain_t amuxVbatGain;
    /* THERM and THERM_BIAS channels scale factor */
    pca9422_amux_therm_gain_t amuxThermGain;
    /* AMUX channel */
    pca9422_amux_channel_t amuxChannel;
    /* The PCA9422 I2C Slave Address. */
    uint8_t slaveAddress;
} pca9422_charger_config_t;

/*! @brief PCA9422 Regulator Configuration Structure definition. */
/*! @brief PCA9422 Buck Configuration Structure definition. */
typedef struct _pca9422_buck_config
{
    uint8_t dvsUpStep;
    uint8_t dvsDnStep;
    uint8_t dvsCtrl;
    pca9422_bx_ramp_t rampSpeed;
    pca9422_bx_lpmode_t lpMode;
    pca9422_bx_ad_t activeDischg;
    pca9422_bx_fpwm_mode_t fpwmEn;
    pca9422_enmode_t enMode;
    uint32_t dvsVout[8];
    uint32_t stbyVout;
    uint32_t maxVout;
    uint32_t sleepVout;
} pca9422_buck_config_t;

