gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/pmic/pca9422/fsl_pca9422.h
/*!
 * @brief Write PCA9422 Regulator enable configurations for run state.
 *
 * This function write the PCA9422 Regulator enable configurations for run state with
 * user-defined settings.
 *
 * @param handle PCA9422 Handle.
 * @param config Pointer to the configuration to save read information.
 */
void PCA9422_WriteRegEnableConfig(pca9422_handle_t *handle, pca9422_regulatoren_t config);

/*!
 * @brief Read PCA9422 regulator enable status for specific modes.
 *
 * This function read the PCA9422 enable status configurations for specific modes with
 * user-defined settings.
 *
 * @param handle PCA9422 Handle.
 * @param powerMode Target mode to read.
 * @param configs Pointer to the enable configuration to save read information.
 */
void PCA9422_ReadEnableConfigs(pca9422_handle_t *handle, pca9422_power_mode_t powerMode, pca9422_enablecfg_t *config);

/*!
 * @brief Feed PCA9422 watchdog.
 *
 * This function feed the PCA9422 watch dog.
 *
 * @param handle PCA9422 Handle.
 */
void PCA9422_FeedWatchDog(pca9422_handle_t *handle);

/*!
 * @brief Set PCA9422 watchdog timer.
 *
 * This function set PCA9422 watch dog timer.
 *
 * @param handle PCA9422 Handle.
 * @param wd_timer PCA9422 Watchdog timer.
 */
void PCA9422_SetWatchDogTimer(pca9422_handle_t *handle, pca9422_wd_timer_t wd_timer);
/* @} */

/*!
 * @name Basic register access functions
 * @{
 */

/*!
 * @brief Write the value to register array of PCA9422.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param regBase variable store base address of register array.
 * @param val variable array to be written to PCA9422.
 * @param size array length in bytes to write.
 * @return true if success or false if error.
 */
bool PCA9422_WriteRegs(pca9422_handle_t *handle, uint8_t regBase, uint8_t *val, uint32_t size);

/*!
 * @brief Read the value of register array in PCA9422.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param regBase variable store address of register array.
 * @param val variable array to store return value.
 * @param size array length in bytes to read.
 * @return true if success or false if error.
 */
bool PCA9422_ReadRegs(pca9422_handle_t *handle, uint8_t regBase, uint8_t *val, uint32_t size);

/*!
 * @brief Modify some bits in the register in PCA9422.
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param reg variable store address of register.
 * @param mask The mask code for the bits want to write. The bit you want to write should be 1.
 * @param val Value needs to write into the register.
 * @return true if success or false if error.
 */
bool PCA9422_ModifyReg(pca9422_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val);

/*!
 * @brief Write the value to register in PCA9422 and read register to confirm it.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param regBase variable store base address of register array.
 * @param val value to be written to PCA9422.
 * @return true if success or false if error.
 */
bool PCA9422_WriteRegsReadback(pca9422_handle_t *handle, uint8_t regBase, uint8_t *val);

/*!
 * @brief Modify some bits in the register in PCA9422 and read register to confirm it.
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param reg variable store address of register.
 * @param mask The mask code for the bits want to write. The bit you want to write should be 1.
 * @param val Value needs to write into the register.
 * @return true if success or false if error.
 */
bool PCA9422_ModifyRegReadback(pca9422_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val);
/* @} */

/*!
 * @name Charger Interrupts
 * @{
 */

/*!
 * @brief Enables PCA9422 Charger interrupts according to the provided interrupt source mask.
 *
 * This function enables the PCA9422 interrupts according to the provided interrupt source.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to interrupt sources of selected interrupt category to enable.
 */
void PCA9422_EnableChargerInterrupts(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Disable PCA9422 Charger interrupts according to the provided interrupt source mask.
 *
 * This function disables the PCA9422 interrupts according to the provided interrupt source.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to interrupt sources of selected interrupt category to disable.
 */
void PCA9422_DisableChargerInterrupts(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Get Charger interrupt flags.
 *
 * This function gets charger interrupt flags.
 * The flags are returned as an array of the corresponding interrupt source:
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to charger interrupt flags.
 */
void PCA9422_GetChargerInterrupts(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Get Charger interrupt status flags.
 *
 * This function gets charger interrupt flags.
 * The flags are returned as an array of the corresponding interrupt source:
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param status Pointer to charger interrupt status flags.
 */
void PCA9422_GetChargerInterruptStatus(pca9422_handle_t *handle, uint8_t *status);

/* @} */

/*!
 * @name Regulator Interrupt
 * @{
 */

/*!
 * @brief Enables PCA9422 Regulator interrupt according to the provided interrupt source mask.
 *
 * This function enables the PCA9422 Regulator interrupt according to the provided interrupt source.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to interrupt source of selected interrupt category to enable.
 */
void PCA9422_EnableRegulatorInterrupt(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Disable PCA9422 Regulator interrupt according to the provided interrupt source mask.
 *
 * This function disables the PCA9422 Regulator interrupt according to the provided interrupt source.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to interrupt source of selected interrupt category to disable.
 */
void PCA9422_DisableRegulatorInterrupt(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Get Regulator interrupt flag.
 *
 * This function gets regulator interrupt flag.
 * The flags are returned as an array of the corresponding interrupt source:
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to regulator interrupt flag.
 */
void PCA9422_GetRegulatorInterrupt(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Get Regulator interrupt status flag.
 *
 * This function gets regulator interrupt status flag.
 * The flags are returned as an array of the corresponding interrupt source:
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param status Pointer to regulator interrupt status flag.
 */
void PCA9422_GetRegulatorInterruptStatus(pca9422_handle_t *handle, uint8_t *status);

/*!
 * @name Sub-level Interrupt
 * @{
 */

/*!
 * @brief Enables PCA9422 Sub level interrupt according to the provided interrupt source mask.
 *
 * This function enables the PCA9422 sub level interrupt according to the provided interrupt source.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to interrupt source of selected interrupt category to enable.
 */
void PCA9422_EnableSublevelInterrupts(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Disable PCA9422 Sub level interrupt according to the provided interrupt source mask.
 *
 * This function disables the PCA9422 sub level interrupt according to the provided interrupt source.
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to interrupt source of selected interrupt category to disable.
 */
void PCA9422_DisableSublevelInterrupts(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Get Sub level interrupt flags.
 *
 * This function gets sub level interrupt flags.
 * The flags are returned as an array of the corresponding interrupt source:
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param source Pointer to sub level interrupt flags.
 */
void PCA9422_GetSublevelInterrupts(pca9422_handle_t *handle, uint8_t *source);

/*!
 * @brief Get Top level interrupt status flag.
 *
 * This function gets top level interrupt status flag.
 * The flags are returned as an array of the corresponding interrupt source:
 *
 * @param handle Pointer to a valid PCA9422 instance structure.
 * @param status Pointer to top level interrupt status flag.
 */
void PCA9422_GetToplevelInterruptStatus(pca9422_handle_t *handle, uint8_t *status);
/* @} */

/*!
 * @name mode control functions
 * @{
 */

/* @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_PCA9422_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
